Repository: rmdeias/Dilitrust
Catalog: translations/messages+intl-icu.*.xlf
Languages: fr

source: Please sign in
fr: Veuillez vous connecter

source: Password
fr: Mot de passe

source: Sign in
fr: Connection

source: Register
fr: Inscription

source: menu.choose_language
fr: Choisir un langage

source: Welcome
fr: Bienvenue

source: Before starting here are some explanations on the logic of the project.
fr: Avant de commencer voici quelques explications sur la logique du projet.

source: I took advantage of this "Challenge" to familiarize myself with the easyadmin bundle and strengthen my knowledge of symfony by trying new features.
fr: J'ai profité de ce "Challenge" pour me familiariser avec le bundle easyadmin et renforcer mes connaissances en symfony en essayant de nouvelles fonctionnalités.

source: The project consists of two entities User and Document.<br>A user contains email, password, role and enable(to deactivate a user).
fr: Le projet est constitué de deux entités User et Document.<br>Un utilisateur contient email, password, role et enable(pour désactiver un utilisateur).

source: There are two roles:
fr: Il y a deux roles :

source: the ROLE_USER who has the right if it is not disabled to connect to the backoffice to post, consult, modify and delete documents.
fr: le ROLE_USER qui a le droit s'il n'est pas désactivé de se connecter en backoffice pour poster,consulter,modifier et supprimer des documents.

source: the ROLE_ADMIN which has the same rights as the ROLE_USER plus the possibility of user management, and see which user has posted which document.
fr: le ROLE_ADMIN qui a les memes droits que le ROLE_USER plus la possibilité gestion d'utilisateur, et voir quel utilisateur a posté quel document.

source: a document can be consulted, deleted or modified
fr: un document peut-etre consulté, supprimé ou modifié

source: Image type documents (JPG, PNG...) can be previewed.
fr: Les document de type image(JPG,PNG...) peuvent etre prévisualisés.

# Script-type documents can be viewed by clicking on &quot;detail document&quot;
source: Script-type documents can be viewed by clicking on "detail document".
fr: Les document de type script peuvent etre consultés en cliquant sur "document détail".

source: You can create a new user or login.
fr: Vous pouvez créer un nouvel utilisateur ou vous connecter.

source: Login
fr: Connection

source: Registration
fr: Inscription

source: ps: sorry for the quality of the rendering, I ran out of time for the project to be more complete front and back
fr: ps: désolé pour ce rendu le temps m'a manqué pour un projet plus complet en front and back
